-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- 생성 시간: 20-06-25 15:09
-- 서버 버전: 10.3.22-MariaDB
-- PHP 버전: 7.3.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `shop8`
--
CREATE DATABASE IF NOT EXISTS `shop8` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `shop8`;

-- --------------------------------------------------------

--
-- 테이블 구조 `jumun`
--

CREATE TABLE `jumun` (
  `no8` char(10) NOT NULL,
  `member_no8` int(11) DEFAULT NULL,
  `jumunday8` date DEFAULT NULL,
  `product_names8` char(255) DEFAULT NULL,
  `product_nums8` int(11) DEFAULT NULL,
  `o_name8` char(20) DEFAULT NULL,
  `o_tel8` char(11) DEFAULT NULL,
  `o_phone8` char(11) DEFAULT NULL,
  `o_email8` char(40) DEFAULT NULL,
  `o_zip8` char(6) DEFAULT NULL,
  `o_juso8` char(100) DEFAULT NULL,
  `r_name8` char(20) DEFAULT NULL,
  `r_tel8` char(11) DEFAULT NULL,
  `r_phone8` char(11) DEFAULT NULL,
  `r_email8` char(40) DEFAULT NULL,
  `r_zip8` char(6) DEFAULT NULL,
  `r_juso8` char(100) DEFAULT NULL,
  `memo8` char(255) DEFAULT NULL,
  `pay_method8` tinyint(4) DEFAULT NULL,
  `card_okno8` char(10) DEFAULT NULL,
  `card_halbu8` tinyint(4) DEFAULT NULL,
  `card_kind8` tinyint(4) DEFAULT NULL,
  `bank_kind8` tinyint(4) DEFAULT NULL,
  `bank_sender8` char(30) DEFAULT NULL,
  `total_cash8` int(11) DEFAULT NULL,
  `state8` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `jumun`
--

INSERT INTO `jumun` (`no8`, `member_no8`, `jumunday8`, `product_names8`, `product_nums8`, `o_name8`, `o_tel8`, `o_phone8`, `o_email8`, `o_zip8`, `o_juso8`, `r_name8`, `r_tel8`, `r_phone8`, `r_email8`, `r_zip8`, `r_juso8`, `memo8`, `pay_method8`, `card_okno8`, `card_halbu8`, `card_kind8`, `bank_kind8`, `bank_sender8`, `total_cash8`, `state8`) VALUES
('2006150001', 2, '2020-06-15', '테스트 외 3', 3, '고구마', '0243129473', '01064323456', 'aaa@aa.aa.aa', '01639', '서울특별시노원구상계로219노원구보훈회관', '고구마', '0243129473', '01064323456', 'aaa@aa.aa.aa', '01639', '서울특별시노원구상계로219노원구보훈회관', '444', 0, '34755679', 6, 1, 0, '0', 17500, 5),
('2006160001', 6, '2020-06-16', '뼈다귀 고기 외 3', 3, '김준형', '0212367896', '01012345567', 'qwert@naver.com', '01779', '서울특별시노원구동일로1229노원구민회관', '김준형', '0212367896', '01012345567', 'qwert@naver.com', '01779', '서울특별시노원구동일로1229노원구민회관', '5555', 0, '98765432', 12, 1, 0, '0', 30500, 1),
('2006160002', 6, '2020-05-06', '테스트 외 2', 2, '김준형', '0212367896', '01012345567', 'qwert@naver.com', '01779', '서울특별시노원구동일로1229노원구민회관', '김준형', '0212367896', '01012345567', 'qwert@naver.com', '01779', '서울특별시노원구동일로1229노원구민회관', '123', 1, '0', 0, 0, 1, '123', 60000, 1);

-- --------------------------------------------------------

--
-- 테이블 구조 `jumuns`
--

CREATE TABLE `jumuns` (
  `no8` int(11) NOT NULL,
  `jumun_no8` char(10) DEFAULT NULL,
  `product_no8` int(11) DEFAULT NULL,
  `num8` int(11) DEFAULT NULL,
  `price8` int(11) DEFAULT NULL,
  `cash8` int(11) DEFAULT NULL,
  `discount8` tinyint(4) DEFAULT NULL,
  `opts_no18` int(11) DEFAULT NULL,
  `opts_no28` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `jumuns`
--

INSERT INTO `jumuns` (`no8`, `jumun_no8`, `product_no8`, `num8`, `price8`, `cash8`, `discount8`, `opts_no18`, `opts_no28`) VALUES
(200, '2006150001', 28, 1, 10000, 5000, 50, 41, 37),
(201, '2006150001', 26, 1, 10000, 5000, 50, 41, 37),
(202, '2006150001', 40, 1, 10000, 5000, 50, 41, 27),
(203, '2006150001', 0, 1, 2500, 2500, 0, 0, 0),
(204, '2006160001', 28, 3, 10000, 5000, 50, 42, 38),
(205, '2006160001', 40, 5, 10000, 5000, 50, 42, 30),
(206, '2006160001', 41, 2, 23000, 18000, 20, 42, 38),
(207, '2006160001', 0, 1, 2500, 2500, 0, 0, 0),
(208, '2006160002', 26, 6, 10000, 5000, 50, 41, 37),
(209, '2006160002', 40, 6, 10000, 5000, 50, 41, 28),
(210, '2006170001', 34, 1, 10000000, 5000000, 50, 42, 42),
(211, '2006170001', 34, 1, 10000000, 5000000, 50, 41, 42),
(212, '2006170001', 41, 1, 23000, 18000, 20, 41, 37),
(213, '2006170001', 40, 1, 10000, 5000, 50, 41, 27),
(214, '2006170001', 34, 1, 10000000, 5000000, 50, 42, 42),
(215, '2006170001', 34, 1, 10000000, 5000000, 50, 41, 42),
(216, '2006170001', 41, 1, 23000, 18000, 20, 41, 37),
(217, '2006170001', 40, 1, 10000, 5000, 50, 41, 27);

-- --------------------------------------------------------

--
-- 테이블 구조 `juso`
--

CREATE TABLE `juso` (
  `no8` int(11) NOT NULL,
  `name8` varchar(30) DEFAULT NULL,
  `tel8` char(11) DEFAULT NULL,
  `sm8` tinyint(4) DEFAULT NULL,
  `birthday8` date DEFAULT NULL,
  `juso8` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `juso`
--

INSERT INTO `juso` (`no8`, `name8`, `tel8`, `sm8`, `birthday8`, `juso8`) VALUES
(1, '최민기', '01627516250', 0, '1990-01-01', '서울 노원구 초안산로 12 인덕대학교 1'),
(2, '노준국', '01192318426', 1, '1990-01-02', '서울 노원구 초안산로 12 인덕대학교 2'),
(3, '배인정', '01091419758', 0, '1990-01-03', '서울 노원구 초안산로 12 인덕대학교 3'),
(4, '윤수진', '01091315099', 0, '1990-01-04', '서울 노원구 초안산로 12 인덕대학교 4'),
(5, '김민주', '01012715951', 1, '1990-01-05', '서울 노원구 초안산로 12 인덕대학교 5'),
(6, '고향에', '01112341234', 0, '1990-01-06', '서울 노원구 초안산로 12 인덕대학교 6'),
(7, '이창기', '01094567737', 0, '1990-01-07', '서울 노원구 초안산로 12 인덕대학교 7'),
(8, '강강술래', '01112341234', 1, '1990-02-14', '서울 노원구 초안산로 12 인덕대학교 111'),
(9, '임상호', '01076212041', 1, '1990-01-09', '서울 노원구 초안산로 12 인덕대학교 9'),
(10, '김경진', '01196616064', 0, '1990-01-10', '서울 노원구 초안산로 12 인덕대학교 10'),
(11, '양지민', '01085916932', 0, '1990-01-11', '서울 노원구 초안산로 12 인덕대학교 11'),
(12, '김철규', '01064517732', 0, '1990-01-12', '서울 노원구 초안산로 12 인덕대학교 12'),
(13, '이재진', '01066725207', 0, '1990-01-13', '서울 노원구 초안산로 12 인덕대학교 13'),
(14, '김인기', '01045825553', 1, '1990-01-14', '서울 노원구 초안산로 12 인덕대학교 14'),
(15, '황호하', '01094529069', 0, '1990-01-15', '서울 노원구 초안산로 12 인덕대학교 15'),
(16, '원미현', '01697323309', 0, '1990-01-16', '서울 노원구 초안산로 12 인덕대학교 16'),
(17, '김성현', '01077524586', 0, '1990-01-17', '서울 노원구 초안산로 12 인덕대학교 17'),
(18, '윤태양', '01044624402', 0, '1990-01-18', '서울 노원구 초안산로 12 인덕대학교 18'),
(19, '손영미', '01063021586', 1, '1990-01-19', '서울 노원구 초안산로 12 인덕대학교 19'),
(20, '서찬국', '01029725437', 0, '1990-01-20', '서울 노원구 초안산로 12 인덕대학교 20'),
(21, '최지호', '01095829293', 0, '1990-01-21', '서울 노원구 초안산로 12 인덕대학교 21'),
(22, '현오석', '01045725203', 0, '1990-01-22', '서울 노원구 초안산로 12 인덕대학교 22'),
(23, '고구마', '01012341234', 0, '1990-01-23', '서울 노원구 초안산로 12 인덕대학교 23'),
(24, '임양진', '01049431735', 0, '1990-01-24', '서울 노원구 초안산로 12 인덕대학교 24'),
(25, '박잔형', '01028732059', 0, '1990-01-25', '서울 노원구 초안산로 12 인덕대학교 25'),
(26, '고맹진', '01012341111', 0, '1990-01-26', '서울 노원구 초안산로 12 인덕대학교 26'),
(27, '이미진', '01032434656', 0, '1990-01-27', '서울 노원구 초안산로 12 인덕대학교 27'),
(28, '박신양', '01032633479', 0, '1990-01-28', '서울 노원구 초안산로 12 인덕대학교 28'),
(29, '이부성', '01022533028', 0, '1990-01-29', '서울 노원구 초안산로 12 인덕대학교 29'),
(30, '박조형', '01034634503', 0, '1990-01-30', '서울 노원구 초안산로 12 인덕대학교 30'),
(31, '김당진', '01022144844', 0, '1990-01-31', '서울 노원구 초안산로 12 인덕대학교 31'),
(32, '임조철', '01063146720', 0, '1990-02-01', '서울 노원구 초안산로 12 인덕대학교 32'),
(33, '최미선', '01023744540', 0, '1990-02-02', '서울 노원구 초안산로 12 인덕대학교 33'),
(34, '정해솔', '01057443220', 1, '1990-02-03', '서울 노원구 초안산로 12 인덕대학교 34'),
(35, '이양석', '01045946853', 0, '1990-02-04', '서울 노원구 초안산로 12 인덕대학교 35'),
(36, '조진현', '01074255035', 0, '1990-02-05', '서울 노원구 초안산로 12 인덕대학교 36'),
(37, '김호석', '01015645583', 0, '1990-02-06', '서울 노원구 초안산로 12 인덕대학교 37'),
(38, '김호식', '01014176818', 0, '1990-02-07', '서울 노원구 초안산로 12 인덕대학교 38'),
(39, '김국진', '01022785917', 0, '1990-02-08', '서울 노원구 초안산로 12 인덕대학교 39'),
(40, '박미희', '01078379430', 0, '1990-02-09', '서울 노원구 초안산로 12 인덕대학교 40'),
(41, '권해미', '010145 7190', 0, '1990-02-10', '서울 노원구 초안산로 12 인덕대학교 41'),
(42, '이성민', '01002544347', 0, '1990-02-11', '서울 노원구 초안산로 12 인덕대학교 42'),
(43, '정다슬', '01036347019', 1, '1990-02-12', '서울 노원구 초안산로 12 인덕대학교 43'),
(44, '육이호', '01092343917', 0, '1990-02-13', '서울 노원구 초안산로 12 인덕대학교 44'),
(45, '한재우', '01193247558', 0, '1990-02-14', '서울 노원구 초안산로 12 인덕대학교 45'),
(46, '정승국', '01023345788', 0, '1990-02-15', '서울 노원구 초안산로 12 인덕대학교 46'),
(47, '양호승', '01083945545', 0, '1990-02-16', '서울 노원구 초안산로 12 인덕대학교 47'),
(48, '윤상현', '01034655978', 0, '1990-02-17', '서울 노원구 초안산로 12 인덕대학교 48'),
(49, '최미문', '01024365634', 0, '1990-02-18', '서울 노원구 초안산로 12 인덕대학교 49'),
(50, '시국진', '01021243572', 0, '1990-02-19', '서울 노원구 초안산로 12 인덕대학교 50'),
(52, '김준형', '01011111111', 0, '1997-01-12', '강북구 수유동'),
(53, '강강강', '01011111111', 0, '1990-01-13', '강북구 수유동1');

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `no8` int(11) NOT NULL,
  `uid8` varchar(20) DEFAULT NULL,
  `pwd8` varchar(20) DEFAULT NULL,
  `name8` varchar(20) DEFAULT NULL,
  `birthday8` date DEFAULT NULL,
  `sm8` tinyint(4) DEFAULT 0,
  `tel8` varchar(11) DEFAULT NULL,
  `phone8` varchar(11) DEFAULT NULL,
  `email8` varchar(40) DEFAULT NULL,
  `zip8` varchar(5) DEFAULT NULL,
  `juso8` varchar(255) DEFAULT NULL,
  `gubun8` tinyint(4) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`no8`, `uid8`, `pwd8`, `name8`, `birthday8`, `sm8`, `tel8`, `phone8`, `email8`, `zip8`, `juso8`, `gubun8`) VALUES
(2, '1234', '1234', '고구마', '1990-01-01', 0, '02 43129473', '01064323456', 'aaa@aa.aa.aa', '01639', '서울특별시노원구상계로219노원구보훈회관 123', 0),
(6, 'q5', '1234', '김준형', '1997-11-11', 1, '02 12367896', '01012345567', 'qwert@naver.com', '01779', '서울특별시노원구동일로1229노원구민회관 12341', 1),
(7, 'asdf', '1234', '김소원', '1997-01-11', 0, '02 12345533', '01053153564', 'qwert@naver.com', '01197', '서울특별시강북구삼양로19길154강북구보건소삼각산분소 1211', 0),
(8, 'abqr3', '1234', '건강원', '1990-01-18', 0, '02 12759897', '01019710972', 'asdjk19@naver.com', '01169', '서울특별시강북구도봉로45길54미아동 307-8 공동주택 12415', 0),
(9, 'qwerrrr', '1234', '강아지', '1990-09-12', 1, '02 45748368', '01048356859', 'sabt@naver.com', '07561', '서울특별시강서구공항대로63길16염창동2차한화꿈에그린아파트 124', 0),
(10, 'test', '1234', '각시탈', '1988-02-05', 0, '01 00000000', '01012347895', 'e@e.e', '01879', '서울특별시노원구초안산로2길68 ㅇ', 1),
(11, 'test', '1234', '홍길동', '1857-02-03', 0, '01044445555', '01087544214', 'test@t.t', '01867', '서울특별시노원구초안산로2길100-9 ㄴㅇ', 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `opt`
--

CREATE TABLE `opt` (
  `no8` int(11) NOT NULL,
  `name8` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `opt`
--

INSERT INTO `opt` (`no8`, `name8`) VALUES
(1, '간식12'),
(2, '신발1'),
(3, '옷2'),
(4, '영양제3'),
(5, '사료'),
(6, '배변패드 향'),
(7, '소형견'),
(11, '맛'),
(12, '주원료'),
(13, '입자크기'),
(14, '종합영양제'),
(15, '영양제연령'),
(16, '배변패드 사이즈'),
(17, '샴푸특징'),
(18, '샴푸사이즈'),
(20, '장난감'),
(21, '장난감/기능'),
(22, '하우스색상'),
(23, '하우스 크기'),
(24, '목줄종류'),
(25, '목줄색상'),
(26, '후드티색상'),
(27, '후드티사이즈');

-- --------------------------------------------------------

--
-- 테이블 구조 `opts`
--

CREATE TABLE `opts` (
  `no8` int(11) NOT NULL,
  `opt_no8` int(11) DEFAULT NULL,
  `name8` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `opts`
--

INSERT INTO `opts` (`no8`, `opt_no8`, `name8`) VALUES
(26, NULL, '소형견'),
(27, 2, '소형견12'),
(28, 2, '중형견'),
(30, 2, '대형견'),
(31, 9, '대형견123'),
(36, 10, '123'),
(37, 4, '비타민A'),
(38, 4, '비타민B'),
(41, 1, '뼈'),
(42, 1, '고기'),
(43, 1, '껌'),
(44, 11, '고기맛'),
(45, 11, '생선맛'),
(46, 11, '우유맛'),
(47, 11, '치즈맛'),
(48, 11, '딸기맛'),
(49, 12, '닭고기'),
(50, 12, '소고기'),
(51, 12, '양고기'),
(52, 12, '오리고기'),
(53, 12, '돼지고기'),
(54, 5, '건식'),
(55, 5, '습식'),
(56, 5, '소프트'),
(57, 5, '생식'),
(58, 5, '분유/우유'),
(59, 13, '작은알갱이'),
(60, 13, '보통알갱이'),
(61, 13, '큰알갱이'),
(62, 14, '분말'),
(63, 14, '액상'),
(64, 14, '알약'),
(65, 15, '전연령'),
(66, 15, '6개월 이상'),
(67, 15, '퍼피'),
(68, 15, '어덜트'),
(69, 15, '시니어'),
(70, 15, '임신/수유'),
(71, 16, '소형'),
(72, 16, '중형'),
(73, 16, '대형'),
(74, 6, '무향'),
(75, 6, '유향'),
(76, 17, '민감피부용'),
(77, 17, '알러지완화'),
(78, 17, '비듬관리'),
(79, 17, '영양공급'),
(80, 17, '탈모관리'),
(81, 17, '보호/보습'),
(83, 18, '소형'),
(84, 18, '중형'),
(85, 18, '대형'),
(89, 20, '노즈워크'),
(90, 20, '봉제장난감'),
(91, 20, '실타래/로프/치실'),
(92, 20, '훈련용품'),
(93, 21, '스트레스해소'),
(94, 21, '치석제거'),
(95, 21, '지능개발'),
(96, 22, '흰색'),
(97, 22, '파란색'),
(98, 22, '노란색'),
(99, 23, '소형'),
(100, 23, '중형'),
(101, 23, '대형'),
(106, 25, '파란색'),
(107, 25, '회색'),
(108, 25, '빨간색'),
(109, 25, '검은색'),
(110, 24, 'S'),
(111, 24, 'M'),
(112, 24, 'L'),
(113, 24, 'XL'),
(114, 26, '핑크'),
(115, 26, '그린'),
(116, 26, '레드'),
(117, 26, '블루'),
(118, 27, 'S'),
(119, 27, 'M'),
(120, 27, 'L'),
(121, 27, 'XL'),
(122, 27, 'XXL');

-- --------------------------------------------------------

--
-- 테이블 구조 `product`
--

CREATE TABLE `product` (
  `no8` int(11) NOT NULL,
  `menu8` int(11) DEFAULT NULL,
  `code8` varchar(20) DEFAULT NULL,
  `name8` varchar(255) DEFAULT NULL,
  `coname8` varchar(30) DEFAULT NULL,
  `price8` int(11) DEFAULT NULL,
  `opt18` int(11) DEFAULT NULL,
  `opt28` int(11) DEFAULT NULL,
  `content8` text DEFAULT NULL,
  `status8` tinyint(4) DEFAULT NULL,
  `regday8` date DEFAULT NULL,
  `icon_new8` tinyint(4) DEFAULT NULL,
  `icon_hit8` tinyint(4) DEFAULT NULL,
  `icon_sale8` tinyint(4) DEFAULT NULL,
  `discount8` tinyint(4) DEFAULT NULL,
  `image18` varchar(255) DEFAULT NULL,
  `image28` varchar(255) DEFAULT NULL,
  `image38` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `product`
--

INSERT INTO `product` (`no8`, `menu8`, `code8`, `name8`, `coname8`, `price8`, `opt18`, `opt28`, `content8`, `status8`, `regday8`, `icon_new8`, `icon_hit8`, `icon_sale8`, `discount8`, `image18`, `image28`, `image38`) VALUES
(18, 3, '3', '배변패드 대', '서울', 30000, 6, 7, '', 2, '2020-05-19', 1, 1, 1, 90, '', '', ''),
(20, 6, '5', 'it\'s 샴푸', '서울', 40000, 6, 8, '', 2, '2020-05-19', 1, 1, 0, 0, '', '', ''),
(21, 1, '55', 'it\'s', '서울', 10000, 5, 7, 'it\'s', 2, '2020-05-19', 0, 0, 1, 10, '', '', ''),
(22, 3, '1234', '강아지 용변패드', '서울', 200000, 5, 5, '', 2, '2020-05-19', 0, 0, 1, 30, '', '', ''),
(26, 1, '000001', '바우와우', '서울', 10000, 1, 4, '\"바우와우 간식...\"', 2, '2020-05-20', 1, 1, 1, 50, '', '', ''),
(27, 1, '000002', '소세지', '서울', 20000, 1, 4, '소세지...', 2, '2020-05-20', 1, 0, 1, 20, '', '', ''),
(28, 1, '000003', '혼합간식', '서울', 10000, 1, 4, '혼합간식...', 2, '2020-05-20', 1, 0, 1, 50, '', '', ''),
(29, 2, '000004', '루돌프 옷', '서울', 60000, 3, 8, '루돌프옷', 2, '2020-05-20', 1, 0, 0, 0, '', '', ''),
(40, 1, '0999', '테스트', '테스트', 10000, 1, 2, '테스트', 2, '2020-05-26', 1, 0, 1, 50, '', '', ''),
(41, 1, '1234', '뼈다귀 고기', '서울', 23000, 12, 11, '간식과 영양을 동시에!!', 1, '2020-05-26', 1, 0, 1, 20, '간식2.jpg', '간식1.JPG', '간식설명.png'),
(42, 1, '1235', '도그빼로', '서울', 5000, 11, 12, '도그빼로!', 1, '2020-06-25', 1, 1, 0, 0, '도그빼로111.jpg', '도그빼로222.JPG', '도그빼로3.png'),
(43, 2, '1236', '도그랑', '서울', 12000, 5, 13, '도그랑 맛좋은 사료!', 1, '2020-06-25', 1, 0, 0, 0, '도그랑11111.jpg', '도그랑1.JPG', '도그랑3.png'),
(44, 2, '1237', '모이스트루', '서울', 15000, 5, 13, '모이스트루 사료!', 1, '2020-06-25', 1, 1, 1, 20, '모이스트루11111.jpg', '모이스트루1.JPG', '도그랑3.png'),
(45, 3, '2000', '몬스터 패드 고급형', '서울', 4000, 16, 6, '몬스터 패드 고급형!!', 1, '2020-06-25', 1, 1, 0, 0, '몬스터 패드 고급형1111.jpg', '몬스터 패드 고급형.JPG', '몬스터 패드 고급형3.png'),
(46, 3, '2001', '바른패드', '서울', 3000, 16, 6, '바른패드!', 1, '2020-06-25', 1, 0, 0, 0, '바른패드11111.jpg', '바른패드.JPG', '바른패드3.png'),
(47, 4, '3001', '버블샴푸', '서울', 20000, 17, 18, '버블샴푸!', 1, '2020-06-25', 1, 0, 1, 10, '버블샴푸11111.jpg', '버블샴푸.JPG', '버블샴푸3.png'),
(48, 4, '3002', '약용샴푸', '서울1', 24000, 17, 18, '약용샴푸!', 1, '2020-06-25', 1, 0, 0, 0, '약용샴푸1111.jpg', '약용샴푸.JPG', '약용샴푸3.png'),
(49, 5, '4000', '데이스포 종합 영양제', '데이스포', 30000, 14, 15, '데이스포 영양제!', 1, '2020-06-25', 1, 0, 0, 0, '데이스포 종합 영양제1111.jpg', '데이스포 종합 영양제.JPG', '데이스포 종합 영양제.png'),
(50, 5, '4001', '메디솔브 코큐텐', '메디솔브', 32000, 14, 15, '메디솔브 영양제!', 1, '2020-06-25', 1, 0, 1, 10, '메디솔브 코큐텐1111.jpg', '메디솔브 코큐텐.JPG', '메디솔브 코큐텐3.png'),
(51, 6, '5000', '바잇미 소다 장난감', '바잇미', 5000, 20, 21, '소다 장난감', 1, '2020-06-25', 1, 1, 0, 0, '바잇미 소다 장난감11111.jpg', '바잇미 소다 장난감.JPG', '소다.png'),
(52, 6, '5001', '바잇미 유해균 바스락 분리 장난감', '바잇미', 5000, 20, 21, '유해균 바스락 분리 장난감', 1, '2020-06-25', 1, 1, 0, 0, '바잇미 유해균 바스락 분리 장난감11111.jpg', '바잇미 유해균 바스락 분리 장난감.JPG', '바잇미 유해균 바스락.png'),
(53, 7, '6000', '스니프 워터프루프', '스니프', 29000, 26, 27, '시니프 워터프루프', 1, '2020-06-25', 1, 1, 1, 30, '스니프 워터프루프1111.jpg', '스니프 워터프루프.JPG', '스니프워터.png'),
(54, 7, '6002', '후드티', '서울', 23000, 26, 27, '후드티!', 1, '2020-06-25', 1, 1, 0, 0, '후드티1111.jpg', '후드티.JPG', '후드티3.png'),
(55, 8, '7000', '베이직리쉬', '베이직', 19000, 24, 25, '산책을 위한 목줄!', 1, '2020-06-25', 1, 0, 0, 0, '베이직리쉬1111.jpg', '베이직리쉬.JPG', '베이직.png'),
(56, 8, '7001', '플렉시 바이오 테이프타입', '플렉시', 21000, 24, 25, '플렉시 바이오 테이프타입 오토목줄!', 1, '2020-06-25', 1, 1, 0, 0, '플렉시 바리오 테이프타입1111.jpg', '플렉시 바리오 테이프타입.JPG', '플렉시바리오.png'),
(57, 9, '8000', '도라에몽 사각방석', '도라에몽', 33000, 22, 23, '도라에몽 사각방석', 1, '2020-06-25', 1, 1, 0, 0, '도라에몽 사각방석1111.jpg', '도라에몽 사각방석.JPG', '도라에몽.png'),
(58, 9, '8001', '숨숨이집', '서울', 18000, 22, 23, '숨숨이집!', 1, '2020-06-25', 1, 1, 0, 0, '숨숨집1111.jpg', '숨숨집.JPG', '숨숨이집.png');

-- --------------------------------------------------------

--
-- 테이블 구조 `sj`
--

CREATE TABLE `sj` (
  `no8` int(11) NOT NULL,
  `name8` varchar(30) DEFAULT NULL,
  `kor8` int(11) DEFAULT NULL,
  `eng8` int(11) DEFAULT NULL,
  `mat8` int(11) DEFAULT NULL,
  `hap8` int(11) DEFAULT NULL,
  `avg8` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `sj`
--

INSERT INTO `sj` (`no8`, `name8`, `kor8`, `eng8`, `mat8`, `hap8`, `avg8`) VALUES
(1, '홍길동', 90, 86, 92, 268, 89.3),
(2, '전미재', 80, 83, 95, 258, 86),
(3, '김양호', 86, 91, 86, 263, 87.7),
(4, '문성진', 90, 87, 69, 246, 82),
(5, '김자완', 95, 86, 93, 274, 91.3),
(6, '오당식', 95, 84, 95, 274, 91.3),
(7, '조성훈', 92, 86, 95, 273, 91),
(8, '박장우', 84, 83, 85, 252, 84),
(9, '지송범', 80, 83, 84, 247, 82.3),
(10, '최미도', 75, 80, 86, 241, 80.3),
(11, '송국영', 84, 84, 95, 263, 87.7),
(12, '염진범', 80, 84, 90, 254, 84.7),
(13, '정아아', 75, 80, 75, 230, 76.7),
(14, '이고석', 79, 82, 83, 244, 81.3),
(15, '심안혜', 83, 83, 89, 255, 85),
(16, '김상민', 85, 85, 91, 261, 87),
(17, '박명수', 93, 83, 95, 271, 90.3),
(18, '김유관', 90, 83, 93, 266, 88.7),
(19, '진수나', 90, 83, 95, 268, 89.3),
(20, '윤정경', 75, 80, 77, 232, 77.3),
(21, '안현철', 82, 82, 87, 251, 83.7),
(22, '민종조', 91, 88, 95, 274, 91.3),
(23, '원우철', 83, 81, 85, 249, 83),
(24, '박규수', 75, 80, 62, 217, 72.3),
(25, '이세철', 80, 83, 87, 250, 83.3),
(26, '곽참만', 82, 83, 89, 254, 84.7),
(27, '한양희', 79, 83, 80, 242, 80.7),
(28, '구박영', 93, 85, 95, 273, 91),
(29, '김사형', 81, 82, 74, 237, 79),
(30, '이상민', 82, 82, 91, 255, 85),
(31, '강안기', 1, 1, 1, 3, 1),
(32, '김장혜', 82, 81, 90, 253, 84.3),
(33, '김정철', 82, 83, 93, 258, 86),
(34, '유요림', 94, 86, 76, 256, 85.3),
(35, '박미기', 90, 84, 95, 269, 89.7),
(36, '김양두', 75, 80, 83, 238, 79.3),
(37, '박상진', 84, 83, 91, 258, 86),
(38, '현잔철', 80, 83, 76, 239, 79.7),
(39, '김진기', 75, 80, 66, 221, 73.7),
(40, '도하진', 93, 84, 95, 272, 90.7),
(41, '윤양국', 80, 82, 70, 232, 77.3),
(42, '김장섭', 80, 82, 91, 253, 84.3),
(43, '구기민', 82, 83, 95, 260, 86.7),
(44, '홍자원', 84, 84, 93, 261, 87),
(45, '오정혜', 92, 83, 87, 262, 87.3),
(46, '김다성', 90, 91, 93, 274, 91.3),
(47, '박정훈', 88, 90, 69, 247, 82.3),
(48, '김오정', 86, 83, 95, 264, 88),
(49, '박청진', 97, 89, 95, 281, 93.7),
(50, '양강현', 90, 85, 79, 254, 84.7),
(53, '김준형', 100, 100, 100, 300, 100);

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `jumun`
--
ALTER TABLE `jumun`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `jumuns`
--
ALTER TABLE `jumuns`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `juso`
--
ALTER TABLE `juso`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `opt`
--
ALTER TABLE `opt`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `opts`
--
ALTER TABLE `opts`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`no8`);

--
-- 테이블의 인덱스 `sj`
--
ALTER TABLE `sj`
  ADD PRIMARY KEY (`no8`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `jumuns`
--
ALTER TABLE `jumuns`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=218;

--
-- 테이블의 AUTO_INCREMENT `juso`
--
ALTER TABLE `juso`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- 테이블의 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 테이블의 AUTO_INCREMENT `opt`
--
ALTER TABLE `opt`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- 테이블의 AUTO_INCREMENT `opts`
--
ALTER TABLE `opts`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;

--
-- 테이블의 AUTO_INCREMENT `product`
--
ALTER TABLE `product`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- 테이블의 AUTO_INCREMENT `sj`
--
ALTER TABLE `sj`
  MODIFY `no8` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;
--
-- 데이터베이스: `test`
--
CREATE DATABASE IF NOT EXISTS `test` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `test`;

-- --------------------------------------------------------

--
-- 테이블 구조 `gubun`
--

CREATE TABLE `gubun` (
  `no15` int(11) NOT NULL,
  `name15` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `gubun`
--

INSERT INTO `gubun` (`no15`, `name15`) VALUES
(3, '채소1'),
(25, '육류'),
(28, '바보'),
(43, '테스트');

-- --------------------------------------------------------

--
-- 테이블 구조 `jangbu`
--

CREATE TABLE `jangbu` (
  `io15` tinyint(4) DEFAULT NULL,
  `writeday15` date DEFAULT NULL,
  `product_no15` int(11) DEFAULT NULL,
  `price15` int(11) DEFAULT NULL,
  `numi15` int(11) DEFAULT NULL,
  `numo15` int(11) DEFAULT NULL,
  `prices15` int(11) DEFAULT NULL,
  `bigo15` varchar(20) DEFAULT NULL,
  `no15` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `jangbu`
--

INSERT INTO `jangbu` (`io15`, `writeday15`, `product_no15`, `price15`, `numi15`, `numo15`, `prices15`, `bigo15`, `no15`) VALUES
(0, '2019-10-02', 7, 50000, 123, 0, 6150000, '', 2),
(0, '2019-10-02', 6, 30000, 20, 0, 600000, '', 4),
(0, '2019-10-02', 6, 30000, 10, 0, 300000, '', 5),
(1, '2019-10-03', 7, 50000, 0, 10, 500000, '', 8),
(1, '2019-10-02', 4, 20000, 0, 10, 200000, '', 9),
(1, '2019-10-02', 4, 20000, 0, 10, 200000, '', 10),
(1, '2019-10-02', 4, 20000, 0, 50, 1000000, '', 11),
(0, '2019-10-04', 6, 30000, 2, 0, 60000, '', 12),
(0, '2019-10-23', 4, 20000, 1000, 0, 20000000, '', 13),
(0, '2019-11-05', 7, 50000, 0, 0, 0, '', 15),
(1, '2019-11-05', 4, 20000, 0, 0, 0, '', 16),
(0, '2019-11-06', 8, 10000, 99, 0, 990000, '테스트', 17),
(1, '2019-11-06', 7, 50000, 0, 50, 2500000, '테스트', 18),
(1, '2019-11-06', 7, 50000, 0, 22, 1100000, '테스트2', 19);

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `no15` int(11) NOT NULL,
  `uid15` varchar(20) NOT NULL,
  `pwd15` varchar(20) NOT NULL,
  `name15` varchar(20) NOT NULL,
  `tel15` varchar(11) DEFAULT NULL,
  `rank15` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`no15`, `uid15`, `pwd15`, `name15`, `tel15`, `rank15`) VALUES
(2, 'id2', '1234', '노기효', '01094818426', 0),
(3, 'id3', '1234', '배안수', '01096029758', 0),
(4, 'id4', '1234', '윤상기', '01091834099', 0),
(5, 'id5', '1234', '남윤주2344', '01099745951', 0),
(7, 'id7', '1234', '이창기', '01094867737', 0),
(11, 'id11', '1234', '양구민', '01089906973', 0),
(12, 'id12', '1234', '박철완', '01064517732', 0),
(13, 'id13', '1234', '이조규', '01064725207', 0),
(15, 'id15', '1234', '황전하', '01098549069', 0),
(16, 'id16', '1234', '원정현', '01097953309', 0),
(18, 'id18', '1234', '윤고영', '01046674402', 0),
(19, 'id19', '1234', '손양진', '01093091586', 0),
(20, 'id20', '1234', '서천범', '01029609537', 0),
(21, 'id21', '1234', '최미은', '01095919293', 0),
(22, 'id22', '1234', '현자석', '01045525203', 0),
(24, 'id24', '1234', '임양진', '01047441735', 0),
(28, 'id28', '1234', '박지영', '01032583779', 0),
(29, 'id29', '1234', '이양성', '01022293628', 0),
(30, 'id30', '1234', '이승권', '01035604903', 0),
(32, 'id32', '1234', '임전철', '01030126920', 0),
(33, 'id33', '1234', '최구선', '01023734840', 0),
(34, 'id34', '1234', '정도솔', '01098643720', 0),
(35, 'id35', '1234', '이영석', '01065956653', 0),
(36, 'id36', '1234', '조경현', '01072265535', 0),
(38, 'id38', '1234', '박만석', '01044184218', 0),
(40, 'id40', '1234', '박솔희', '01075709030', 0),
(42, 'id42', '1234', '이성민', '01036524847', 0),
(43, 'id43', '1234', '장도운', '01035337719', 0),
(45, 'id45', '1234', '황지우', '01091057558', 0),
(46, 'id46', '1234', '정기근', '01025764748', 0),
(47, 'id47', '1234', '양자승', '01080972732', 0),
(48, 'id48', '1234', '윤성현', '01030685978', 0),
(49, 'id49', '1234', '최기문', '01027595634', 0),
(50, 'id50', '1234', '오시헌', '01020203572', 0),
(64, '123', '123', '김기동3', '123123 123 ', 1),
(67, '123', '312', '김강', '12321332313', 1),
(68, '3', '3', '3', '3  3   3   ', 1),
(70, '2', '2', '2', '2  2   2   ', 1),
(71, '1', '13', '김강', '13 13  13  ', 1),
(72, '8', '8', '8', '8  8   8   ', 1),
(73, '8', '8', '8', '8  8   8   ', 1),
(74, '3', '3', '3', '3  32113   ', 1),
(75, '2', '2', '2', '2  2   2   ', 1),
(76, '1', '2', '2', '2  2       ', 1),
(77, '3', '3', '3', '3  3   3   ', 1),
(78, '4', '4', '4', '4  4   4   ', 1),
(84, 'ㅁㅇㄴ', 'ㅁㅇㄴ', 'ㅁㄴㅇ', 'ㅇㅁㄴㅁㅇㄴㅇㅁㄴ', 1),
(85, '1', '1', '김밥', '1  1   1   ', 1),
(88, '1', '1', '1', '1      1132', 1),
(89, '1', '1', '1', '1  1   1111', 0),
(91, '1', '1', '121234134131231', '1232   2   ', 1),
(92, '123', '123', '김', '123123 1234', 1),
(93, '321', '321', '312', '123123 123 ', 1),
(94, '123', 'ㅂㅂㅈ', '33333333333333333333', '12313211321', 1);

-- --------------------------------------------------------

--
-- 테이블 구조 `member_p`
--

CREATE TABLE `member_p` (
  `no15` int(11) NOT NULL,
  `id15` varchar(15) DEFAULT NULL,
  `pw15` varchar(15) DEFAULT NULL,
  `name15` varchar(5) DEFAULT NULL,
  `birth15` date DEFAULT NULL,
  `tel15` varchar(11) DEFAULT NULL,
  `juso15` varchar(300) DEFAULT NULL,
  `nick15` varchar(10) DEFAULT NULL,
  `okno15` tinyint(4) NOT NULL DEFAULT 0,
  `rank15` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `member_p`
--

INSERT INTO `member_p` (`no15`, `id15`, `pw15`, `name15`, `birth15`, `tel15`, `juso15`, `nick15`, `okno15`, `rank15`) VALUES
(1, '1', '1234', '김선규', '1234-12-12', '12312311231', '1234', '1234', 1, 1),
(2, '2', '2', '2', '0000-00-00', '222', '2', '2', 1, 0),
(3, '3', '3', '3', '0000-00-00', '33213', '3', '3', 0, 0),
(4, '6', '6', '6', '0000-00-00', '666', '6', '6', 0, 0),
(5, '4', '4', '4', '0000-00-00', '444', '4', '4', 0, 0),
(6, '7', '7', '7', '0000-00-00', '777', '7', '7', 0, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `post`
--

CREATE TABLE `post` (
  `no15` int(11) NOT NULL,
  `member_no15` int(11) NOT NULL,
  `title15` varchar(30) NOT NULL,
  `board15` varchar(300) NOT NULL,
  `report_date15` date NOT NULL,
  `hits15` int(11) NOT NULL DEFAULT 0,
  `notice15` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `post`
--

INSERT INTO `post` (`no15`, `member_no15`, `title15`, `board15`, `report_date15`, `hits15`, `notice15`) VALUES
(1, 1, '공지테스트1', '테스트1123', '2019-10-30', 35, 1),
(2, 1, '공지테스트2', '테스트2', '2019-10-30', 32, 1),
(3, 1, '테스트1123', '테스트1213', '2019-10-30', 19, 0),
(4, 2, '테스트2', '테스트2', '2019-10-30', 9, 0),
(5, 1, '감자', '감자', '2019-10-30', 4, 0),
(6, 1, '11', '11', '2019-10-30', 7, 0),
(7, 1, '123', '123', '2019-11-01', 10, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `product`
--

CREATE TABLE `product` (
  `no15` int(11) NOT NULL,
  `gubun_no15` int(11) DEFAULT NULL,
  `name15` varchar(30) DEFAULT NULL,
  `price15` int(11) DEFAULT NULL,
  `jaego15` int(11) DEFAULT NULL,
  `pic15` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `product`
--

INSERT INTO `product` (`no15`, `gubun_no15`, `name15`, `price15`, `jaego15`, `pic15`) VALUES
(4, 3, '소고기', 20000, 930, NULL),
(6, 3, '오이', 30000, 32, '다운로드.jpg'),
(7, 3, '당근', 50000, 113, NULL),
(8, 43, '돼지고기', 10000, 0, '다운로드.png'),
(10, 25, 'asddsaads', 123123, 0, '213312asddsa.PNG'),
(16, 3, '123123213213', 333, 333, '213312asddsa.PNG');

-- --------------------------------------------------------

--
-- 테이블 구조 `temp`
--

CREATE TABLE `temp` (
  `no15` int(11) NOT NULL,
  `product_no15` int(11) DEFAULT NULL,
  `jaego15` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `temp`
--

INSERT INTO `temp` (`no15`, `product_no15`, `jaego15`) VALUES
(1, 4, 930),
(2, 6, 32),
(3, 7, 113);

-- --------------------------------------------------------

--
-- 테이블 구조 `test`
--

CREATE TABLE `test` (
  `no55` int(11) NOT NULL,
  `goodname55` varchar(40) NOT NULL,
  `cophone55` varchar(11) DEFAULT NULL,
  `kind55` tinyint(4) DEFAULT NULL,
  `regday55` date DEFAULT NULL,
  `content55` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `test`
--

INSERT INTO `test` (`no55`, `goodname55`, `cophone55`, `kind55`, `regday55`, `content55`) VALUES
(1, '민수 제품', '016275 6250', 0, '1990-01-01', '싸고 좋은 제품 1'),
(2, '준효 제품', '011948 8426', 1, '1990-01-02', '싸고 좋은 제품 2'),
(3, '인수 제품', '010960 9758', 0, '1990-01-03', '싸고 좋은 제품 3'),
(4, '수민 제품', '010918 4099', 0, '1990-01-04', '싸고 좋은 제품 4'),
(5, '윤주 제품', '010997 5951', 1, '1990-01-05', '싸고 좋은 제품 5'),
(6, '향은 제품', '011667 2295', 0, '1990-01-06', '싸고 좋은 제품 6'),
(7, '창재 제품', '010948 7737', 0, '1990-01-07', '싸고 좋은 제품 7'),
(8, '범석 제품', '011971 5378', 0, '1990-01-08', '싸고 좋은 제품 8'),
(9, '상준 제품', '010732 2001', 1, '1990-01-09', '싸고 좋은 제품 9'),
(10, '경현 제품', '011906 6074', 0, '1990-01-10', '싸고 좋은 제품 10'),
(11, '규민 제품', '010899 6973', 0, '1990-01-11', '싸고 좋은 제품 11'),
(12, '철완 제품', '010645 7732', 0, '1990-01-12', '싸고 좋은 제품 12'),
(13, '재규 제품', '010647 5207', 0, '1990-01-13', '싸고 좋은 제품 13'),
(14, '인곤 제품', '010478 5553', 1, '1990-01-14', '싸고 좋은 제품 14'),
(15, '정하 제품', '010985 9069', 0, '1990-01-15', '싸고 좋은 제품 15'),
(16, '종현 제품', '016979 3309', 0, '1990-01-16', '싸고 좋은 제품 16'),
(17, '상현 제품', '010715 4586', 0, '1990-01-17', '싸고 좋은 제품 17'),
(18, '태영 제품', '010466 4402', 0, '1990-01-18', '싸고 좋은 제품 18'),
(19, '영진 제품', '010930 1586', 1, '1990-01-19', '싸고 좋은 제품 19'),
(20, '찬범 제품', '010296 5437', 0, '1990-01-20', '싸고 좋은 제품 20'),
(21, '지은 제품', '010959 9293', 0, '1990-01-21', '싸고 좋은 제품 21'),
(22, '준석 제품', '010455 5203', 0, '1990-01-22', '싸고 좋은 제품 22'),
(23, '윤진 제품', '010390 9565', 0, '1990-01-23', '싸고 좋은 제품 23'),
(24, '영진 제품', '010474 1735', 0, '1990-01-24', '싸고 좋은 제품 24'),
(25, '진형 제품', '010297 2059', 0, '1990-01-25', '싸고 좋은 제품 25'),
(26, '명한 제품', '011173 1347', 1, '1990-01-26', '싸고 좋은 제품 26'),
(27, '동진 제품', '010323 4656', 0, '1990-01-27', '싸고 좋은 제품 27'),
(28, '신영 제품', '010325 3479', 0, '1990-01-28', '싸고 좋은 제품 28'),
(29, '윤성 제품', '010222 3028', 0, '1990-01-29', '싸고 좋은 제품 29'),
(30, '재형 제품', '010356 4503', 0, '1990-01-30', '싸고 좋은 제품 30'),
(31, '동우 제품', '011291 4844', 0, '1990-01-31', '싸고 좋은 제품 31'),
(32, '진철 제품', '010301 6720', 0, '1990-02-01', '싸고 좋은 제품 32'),
(33, '교선 제품', '010237 4540', 0, '1990-02-02', '싸고 좋은 제품 33'),
(34, '다솔 제품', '010986 3220', 1, '1990-02-03', '싸고 좋은 제품 34'),
(35, '용석 제품', '010659 6853', 0, '1990-02-04', '싸고 좋은 제품 35'),
(36, '광현 제품', '010722 5035', 0, '1990-02-05', '싸고 좋은 제품 36'),
(37, '민석 제품', '019346 0583', 0, '1990-02-06', '싸고 좋은 제품 37'),
(38, '민식 제품', '016441 4818', 0, '1990-02-07', '싸고 좋은 제품 38'),
(39, '호진 제품', '010240 5917', 0, '1990-02-08', '싸고 좋은 제품 39'),
(40, '설희 제품', '010757 9430', 0, '1990-02-09', '싸고 좋은 제품 40'),
(41, '혜미 제품', '010245 7190', 0, '1990-02-10', '싸고 좋은 제품 41'),
(42, '상민 제품', '010365 4347', 0, '1990-02-11', '싸고 좋은 제품 42'),
(43, '다운 제품', '010353 7019', 1, '1990-02-12', '싸고 좋은 제품 43'),
(44, '일남 제품', '010969 3917', 0, '1990-02-13', '싸고 좋은 제품 44'),
(45, '지우 제품', '011910 7558', 0, '1990-02-14', '싸고 좋은 제품 45'),
(46, '승근 제품', '010257 4788', 0, '1990-02-15', '싸고 좋은 제품 46'),
(47, '재승 제품', '010809 2792', 0, '1990-02-16', '싸고 좋은 제품 47'),
(48, '승현 제품', '010306 5978', 0, '1990-02-17', '싸고 좋은 제품 48'),
(49, '문현 제품', '010275 5634', 0, '1990-02-18', '싸고 좋은 제품 49'),
(50, '헌시 제품', '010202 3572', 0, '1990-02-19', '싸고 좋은 제품 50');

-- --------------------------------------------------------

--
-- 테이블 구조 `t_comment`
--

CREATE TABLE `t_comment` (
  `no15` int(11) NOT NULL,
  `t_member_no15` int(11) DEFAULT NULL,
  `t_post_no15` int(11) DEFAULT NULL,
  `comment15` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `t_comment`
--

INSERT INTO `t_comment` (`no15`, `t_member_no15`, `t_post_no15`, `comment15`) VALUES
(40, 2, 16, 'ㄴㅇ55ㅋㅌㅊㅋㅌㅅㅅㅅ'),
(41, 2, 16, '그랭ㅎㅎ'),
(42, 2, 15, '그랭ㅎㅎ'),
(46, 2, 16, 'alert&#40;no&#41;;'),
(47, 2, 16, 'alert&#40;no&#41;;'),
(48, 2, 16, 'alert&#40;no&#41;;'),
(49, 2, 16, 'alert&#40;no&#41;;'),
(50, 2, 16, 'alert&#40;no&#41;;'),
(51, 2, 16, 'alert&#40;no&#41;;'),
(52, 2, 16, 'alert&#40;no&#41;;'),
(53, 2, 16, 'alert&#40;no&#41;;'),
(54, 2, 16, 'alert&#40;no&#41;;'),
(57, 2, 15, 'zz'),
(58, 2, 15, 'ㅋㅋㅁㄴㅇ'),
(59, 2, 15, 'ㅁㅇㅁㅇㄴㅁㅇㄴㅁ'),
(60, 2, 15, '2'),
(61, 1, 20, '213'),
(62, 1, 20, '5'),
(63, 1, 26, '댓글'),
(64, 1, 26, 'ㅅㅅ'),
(65, 1, 26, 'ㅛㅛ'),
(66, 1, 26, 'ㄱㄱ'),
(67, 1, 26, 'ㅇㅇ'),
(68, 1, 23, '55');

-- --------------------------------------------------------

--
-- 테이블 구조 `t_help`
--

CREATE TABLE `t_help` (
  `no15` int(11) NOT NULL,
  `t_member_id15` varchar(20) DEFAULT NULL,
  `t_member_email15` varchar(20) DEFAULT NULL,
  `board15` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `t_help`
--

INSERT INTO `t_help` (`no15`, `t_member_id15`, `t_member_email15`, `board15`) VALUES
(13, '201612035', '123@123', '건의테스트1'),
(14, '201612035', '123@123', '건의테스트2'),
(15, '201612035', '123@123', '건의테스트3'),
(16, '201612035', '123@123', '건의테스트4'),
(17, '201612035', '123@123', '건의테스트5\n'),
(18, '201612035', '123@123', '건의테스트6'),
(19, '201612035', '123@123', '건의테스트7'),
(20, '201612035', '123@123', '건의테스트8'),
(21, '201612035', '123@123', '건의테스트9');

-- --------------------------------------------------------

--
-- 테이블 구조 `t_member`
--

CREATE TABLE `t_member` (
  `no15` int(11) NOT NULL,
  `id15` varchar(20) DEFAULT NULL,
  `pw15` varchar(20) DEFAULT NULL,
  `name15` varchar(20) DEFAULT NULL,
  `email15` varchar(20) DEFAULT NULL,
  `tel15` varchar(14) DEFAULT NULL,
  `birth15` date DEFAULT NULL,
  `nick15` varchar(20) DEFAULT NULL,
  `juso15` varchar(255) DEFAULT NULL,
  `sex15` tinyint(4) NOT NULL,
  `okno15` tinyint(4) DEFAULT NULL,
  `rank15` tinyint(4) DEFAULT NULL,
  `oknonum15` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `t_member`
--

INSERT INTO `t_member` (`no15`, `id15`, `pw15`, `name15`, `email15`, `tel15`, `birth15`, `nick15`, `juso15`, `sex15`, `okno15`, `rank15`, `oknonum15`) VALUES
(1, 'admin', '1234', '김선규', 'doerksk@naver.com', '010-1234-5678', '1997-06-03', '김선규', '경기도 의정부시', 0, 1, 1, ''),
(2, '1', '11', '김규', 'tt@tt.tt', '010-1234-5678', '1996-06-06', 'adskdksqk', 'tt', 1, 1, NULL, ''),
(3, '213', '2', '길동', '2@2', '010-8859-4075', '1997-11-11', '2', '2', 1, 1, 1, ''),
(20, 'tttt', 'tttttt', '가길동', '343t@34t', '010-1234-567', '1997-06-01', '3t4', '3t4', 1, 1, 0, ''),
(24, 'test1', 'test1', '나길동', 'test1@test1.test1', '010-1234-5678', '1998-01-01', 'test1', 'test1', 0, 1, 0, ''),
(25, 'test2', 'test2', '다길동', 'doerksk@naver.com', '010-1234-5678', '1997-01-01', 'test2', 'test2', 1, 1, 0, ''),
(26, 'test3', 'test3', '라길동', 'doerksk@naver.com', '010-1234-5678', '1997-01-01', 'test3', 'test3', 0, 0, 0, ''),
(27, 'test4', 'test4', '마길동', 'test4@test4.com', '010-1234-5678', '1997-01-01', 'test4', 'test4', 1, 1, 0, ''),
(28, 'test5', 'test5', '바길동', '123@123', '010-1234-5678', '1997-01-01', 'test5', 'test5', 0, 1, 0, ''),
(29, 'test6', 'test6', '사길동', '123@123', '010-1234-5678', '1997-01-01', 'test6', 'test6', 0, 1, 0, ''),
(30, 'test7', 'test7', '아길동', '123@123', '010-1234-5678', '1997-01-01', 'test7', 'test7', 0, 1, 0, ''),
(31, 'test8', 'test8', '자길동', '123@123', '010-1234-5678', '1997-01-01', 'test8', 'test8', 0, 1, 0, ''),
(32, 'test9', 'test9', '차길동', '123@123', '010-1234-5678', '1997-01-01', 'test9', 'test9', 0, 1, 0, ''),
(33, 'test10', 'test10', '타길동', '123@123', '010-1234-5678', '1997-01-01', 'test10', 'test10', 0, 1, 0, ''),
(34, 'test11', 'test11', '파길동', '123@123', '010-1234-5678', '1997-01-01', 'test11', 'test11', 1, 1, 1, ''),
(36, '고길동', '고길동', '고길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '고길동', '고길동', 0, 0, 0, ''),
(37, '132', '123', '노길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '고길동', '고길동', 0, 0, 0, ''),
(38, '2243', 'r3232', '도길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '도길동', '고길동', 1, 0, 0, ''),
(39, '고길동ㅇㄴㅁ', 'ㅁㄴㅇㅇㅁㄴ', '로길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '고길동', '고길동', 1, 0, 0, ''),
(40, '모길동', '123', '모길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '모길동', '모길동', 0, 0, 0, ''),
(41, '보길동', '123', '보길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '보길동', '보길동', 0, 0, 0, ''),
(42, '소길동', '소길동', '소길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '소길동', '소길동', 1, 0, 0, ''),
(43, '오길동', '고길동', '오길동', 'asd@asd.com', '010-1234-5678', '1997-06-01', '오길동', '오길동', 1, 0, 0, ''),
(44, 'ㄱㄱㄱ', '123213', '이락준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '321321', '312132321', 0, 0, 0, 'CkYtPyT9Mu'),
(45, 'ㅁㅁㅁ', '123213', '이락준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '321321', '312132321', 0, 0, 0, '847Qyr1kAE'),
(46, '1213312321', '123213', '이락준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '321321', '312132321', 0, 0, 0, 'h5zsanatUb'),
(47, '12133123216', '123213', '이락준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '321321', '312132321', 0, 0, 0, 'hXJfe2Jhny'),
(48, '12', '123213', '이락준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '321321', '312132321', 0, 0, 0, 'qTzAt39Fkt'),
(49, 'ㅁㄴㅇㅁㅇㄴ', 'ㅁㄴㅇ', '이핵준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '10gkrwns', 'asd', 0, 0, 0, 'Y6grrV2Xev'),
(50, 'ㅁㄴㅇㅁㅇㄴw', 'ㅁㄴㅇ', '이핵준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '10gkrwns', 'asd', 0, 0, 0, 'rxjMxk9drf'),
(51, 'asdzx', 'ㅁㄴㅇ', '이핵준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '10gkrwns', 'asd', 0, 0, 0, 'j5t2GzKMJw'),
(52, 'asdzx7', 'asd', '이핵준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '10gkrwns', 'asd', 0, 1, 0, ''),
(53, 'dlgkrwns', '123', '이학준', '10gkrwns@naver.com', '010-1234-5678', '1999-01-01', '리학준', 'asd', 1, 1, 0, ''),
(54, 'abcd', '1234', '김산규', 'deorksk@naver.com', '010-1112-1112', '1997-06-03', '아나카느저', '우터나재다', 0, 0, 0, 'tnRcqxEKkq'),
(55, 'abcd1', '1234', '김산규', 'doerksk@naver.com', '010-1112-1112', '1997-06-03', '아나카느저', '우터나재다', 0, 1, 0, ''),
(56, 'akfkakfk', 'akfkakfk', '김선규', 'doerksk@naver.com', '010-1234-5678', '1997-06-01', '고길동', 'asd', 0, 1, 0, ''),
(57, '213221', '고길동', '김선규', 'asd@asd.com', '010-1234-5678', '1997-06-01', 'ads', 'ads', 0, 0, 0, 'eefLKqggi6'),
(58, '123', '213132321', '김사맘', 'doerksk@naver.com', '010-1234-5678', '1997-06-03', 'adsadsqw', 'asddw', 1, 1, 0, 'RJaqUpYJeX'),
(59, '3', '3', '3', 'doerksk@naver.com', '010-1234-5678', '1999-01-01', '3', '3', 0, 0, 0, 'pPdM_YOxxj');

-- --------------------------------------------------------

--
-- 테이블 구조 `t_notice`
--

CREATE TABLE `t_notice` (
  `no15` int(11) NOT NULL,
  `title15` varchar(20) DEFAULT NULL,
  `board15` varchar(200) DEFAULT NULL,
  `report_date15` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `t_notice`
--

INSERT INTO `t_notice` (`no15`, `title15`, `board15`, `report_date15`) VALUES
(10, '공지사항 테스트1', '123', '2019-11-08'),
(11, '공지사항 테스트2', '2', '2019-11-08'),
(12, '공지사항 테스트3', '공지사항 테스트3', '2019-11-08'),
(13, '공지사항 테스트4', '4', '2019-11-08'),
(14, '공지사항 테스트5', '공지사항 테스트5', '2019-11-08'),
(15, '공지사항 테스트6', '5', '2019-11-08'),
(16, '공지사항 테스트7', '234', '2019-11-08'),
(17, '공지사항 테스트8', '234', '2019-11-08'),
(18, '공지사항 테스트9', '423', '2019-11-08'),
(19, '공지사항 테스트10', '44', '2019-11-08'),
(20, '공지사항 테스트111', '3', '2019-11-08');

-- --------------------------------------------------------

--
-- 테이블 구조 `t_post`
--

CREATE TABLE `t_post` (
  `no15` int(11) NOT NULL,
  `t_member_no15` int(11) DEFAULT NULL,
  `title15` varchar(30) DEFAULT NULL,
  `country15` varchar(20) DEFAULT NULL,
  `money15` int(11) DEFAULT NULL,
  `startday15` date DEFAULT NULL,
  `day15` int(11) DEFAULT NULL,
  `board15` varchar(255) DEFAULT NULL,
  `report_date15` date DEFAULT NULL,
  `hits15` int(11) DEFAULT NULL,
  `comment_count15` int(11) DEFAULT 0,
  `gubun15` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `t_post`
--

INSERT INTO `t_post` (`no15`, `t_member_no15`, `title15`, `country15`, `money15`, `startday15`, `day15`, `board15`, `report_date15`, `hits15`, `comment_count15`, `gubun15`) VALUES
(4, 1, '안녕하새요', '우리집', 50, '2019-01-01', 99, '반갑습니다.', '2019-11-04', 3, 0, 5),
(7, 1, '22', '123', 123, '0000-00-00', 123, '132', '2019-11-06', 26, 0, 1),
(15, 2, '오 안늉 ㅎㅎㅎㅎ', '양주', 0, '0000-00-00', 0, 'ㅁㅁ', '2019-11-07', 83, 5, 1),
(16, 2, '아 게임지기 들어오기 힘들었다', '동두천', 123, '9999-11-11', 12, '2231', '2019-11-07', 205, 11, 1),
(18, 1, '123123', '통영', 123, '1997-06-03', 123, '213', '2019-11-08', 29, 0, 1),
(19, 1, 'ㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅㅅ', '강원도', 0, '1997-06-03', 22, 'ㅏ마', '2019-11-09', 8, 0, 1),
(20, 1, '게시글테스트1', '부산', 2, '2019-11-10', 242, '게시글테스트1', '2019-11-10', 15, 2, 1),
(21, 1, '게시글테스트2', '의정부', 1, '2010-11-10', 24, '게시글테스트', '2019-11-10', 2, 0, 1),
(22, 1, '게시글테스트3', '서울', 22, '2019-12-12', 13, '13', '2019-11-10', 3, 0, 1),
(23, 1, '게시글테스트4', '제주도', 30, '2019-11-10', 24, '게시글테스트', '2019-11-10', 8, 0, 1),
(24, 1, '게시글테스트5', '인천', 1, '2019-01-01', 2, '게시글테스트', '2019-11-10', 0, 0, 1),
(25, 1, '게시글 테스트6', '한강', 1, '2019-01-01', 99, 'ㄴ', '2019-11-10', 12, 0, 1),
(26, 1, '게시글테스트7', '태국', 100, '2019-11-10', 88, '게시글테스트7', '2019-11-10', 8, 4, 2);

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `gubun`
--
ALTER TABLE `gubun`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `jangbu`
--
ALTER TABLE `jangbu`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `member_p`
--
ALTER TABLE `member_p`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `temp`
--
ALTER TABLE `temp`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `test`
--
ALTER TABLE `test`
  ADD PRIMARY KEY (`no55`);

--
-- 테이블의 인덱스 `t_comment`
--
ALTER TABLE `t_comment`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `t_help`
--
ALTER TABLE `t_help`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `t_member`
--
ALTER TABLE `t_member`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `t_notice`
--
ALTER TABLE `t_notice`
  ADD PRIMARY KEY (`no15`);

--
-- 테이블의 인덱스 `t_post`
--
ALTER TABLE `t_post`
  ADD PRIMARY KEY (`no15`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `gubun`
--
ALTER TABLE `gubun`
  MODIFY `no15` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- 테이블의 AUTO_INCREMENT `jangbu`
--
ALTER TABLE `jangbu`
  MODIFY `no15` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- 테이블의 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `no15` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;

--
-- 테이블의 AUTO_INCREMENT `member_p`
--
ALTER TABLE `member_p`
  MODIFY `no15` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 테이블의 AUTO_INCREMENT `test`
--
ALTER TABLE `test`
  MODIFY `no55` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
